Revit 2018 API
Face.Intersect Method (Face, Curve)
Calculates the intersection of the specified face with this face and returns the intersection results.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Syntax
C#
public FaceIntersectionFaceResult Intersect(
	Face face,
	out Curve result
)
Visual Basic
Public Function Intersect ( _
	face As Face, _
	<OutAttribute> ByRef result As Curve _
) As FaceIntersectionFaceResult
Visual C++
public:
FaceIntersectionFaceResult Intersect(
	Face^ face,
	[OutAttribute] Curve^% result
)
Parameters
face
Type: Autodesk.Revit.DB.Face
The specified face to intersect with this face.
result
Type: Autodesk.Revit.DB.Curve
A single Curve representing the intersection.
Return Value
FaceIntersectionFaceResult.Intersecting - One or more intersections were encountered.
SetComparisonResult.NonIntersecting - There is no intersection found.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  The face is null.
Autodesk.Revit.Exceptions.InvalidOperationException |  The intersection calculation fails.
See Also
Face Class
Intersect Overload
Autodesk.Revit.DB Namespace